glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32GGxxx_DFP.pdsc
      <sequences>

        <!-- ResetHardware: A HW reset also resets the debug interface.
             A debugger needs to be capable of restoring a debug connection.
             Otherwise, the HW reset cannot be used. -->

        <!-- Pre-defined Debug Access Sequences -->

        <!-- Begin: TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO  = (__traceout &amp; 0x1) != 0;
            __var traceTPIU = (__traceout &amp; 0x2) != 0;
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");
            </block>
          </control>
        </sequence>
        <!-- End: TraceStart Sequence -->

        <!-- Begin: TraceStop Sequence -->
        <sequence name="TraceStop">
          <block>
            __var traceSWO       = (__traceout &amp; 0x1) != 0;
            __var traceTPIU      = (__traceout &amp; 0x2) != 0;
          </block>

          <control if="traceSWO">
            <block>
              Sequence("DisableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
        </sequence>
        <!-- End: TraceStop Sequence -->


        <!-- User-defined Debug Access Sequences -->

        <!-- Begin: SelectTraceClock Sequence -->
        <sequence name="SelectTraceClock">
          <control if="TraceClkSrc == 0">
            <block>
              // Use System Clock for Trace
              Write32(0x400C8000, (Read32(0x400C8000) | (1 &lt;&lt; 28)));  // Set CMU_CTRL.DBGCLK to HFCLK
            </block>
          </control>

          <control if="TraceClkSrc == 1">
            <block>
              // Use AUXHFRCO for Trace
              Write32(0x400C8000, (Read32(0x400C8000) &amp; ~(1 &lt;&lt; 28)));  // Set CMU_CTRL.DBGCLK to AUXHFRCO
            </block>

            <control if="((Read32(0x400C802C) &amp; (1 &lt;&lt; 5)) == 0)">
              <block>
                // Enable AUXHFRCO
                Write32(0x400C8020, (1 &lt;&lt; 4));
              </block>
              <!-- Wait for AUXHFRCO selection to become stable -->
              <control while="(Read32(0x400C802C) &amp; (1 &lt;&lt; 5)) == 0" timeout="1000000"/>
            </control>

          </control>
        </sequence>
        <!-- End: SelectTraceClock Sequence -->

        <!-- Begin: EnableTraceSWO Sequence -->
        <sequence name="EnableTraceSWO">
          <block>
            __var gpioRouteMask = 0x00000304; // (SWLOCATION|SWOPEN)

            // Enable peripheral clocks (LE, GPIO)
            Write32(0x400C8040, (Read32(0x400C8040) | (1 &lt;&lt;  4)));
            Write32(0x400C8044, (Read32(0x400C8044) | (1 &lt;&lt; 13)));

            Sequence("SelectTraceClock");  // Configure trace clock on device
          </block>

          <control if="PinLocationSWO == 0">
            <block>
              Write32(0x400060B8, (Read32(0x400060B8) &amp; ~0x00000F00) | 0x00000400); // GPIO_PF_MODEL Pin 2 - PUSHPULL: SWO
            </block>
          </control>

          <control if="PinLocationSWO == 1">
            <block>
              Write32(0x40006050, (Read32(0x40006050) &amp; ~0xF0000000) | 0x40000000); // GPIO_PC_MODEH Pin 7 - PUSHPULL: SWO
            </block>
          </control>

          <control if="PinLocationSWO == 2">
            <block>
              Write32(0x40006070, (Read32(0x40006070) &amp; ~0x0000000F) | 0x00000004); // GPIO_PD_MODEL Pin 0 - PUSHPULL: SWO
            </block>
          </control>

          <control if="PinLocationSWO == 3">
            <block>
              Write32(0x40006070, (Read32(0x40006070) &amp; ~0x000000F0) | 0x00000040); // GPIO_PD_MODEL Pin 1 - PUSHPULL: SWO
            </block>
          </control>

          <block>
            // Set GPIO_ROUTE
            Write32(0x40006120, (Read32(0x40006120) &amp; ~gpioRouteMask) | (0x1 &lt;&lt; 2) | (PinLocationSWO &lt;&lt; 8));
          </block>

        </sequence>
        <!-- End: EnableTraceSWO Sequence -->

        <!-- Begin: EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;
            __var gpioRoute      = 0;
            __var gpioRouteMask  = 0x0301F000;  // (ETMLOCATION|TCLKPEN|TD0PEN|TD1PEN|TD2PEN|TD3PEN)

            // Enable peripheral clocks (LE, GPIO)
            Write32(0x400C8040, (Read32(0x400C8040) | (1 &lt;&lt;  4)));
            Write32(0x400C8044, (Read32(0x400C8044) | (1 &lt;&lt; 13)));

            Sequence("SelectTraceClock");  // Configure trace clock on device

            gpioRoute = (PinLocationTPIU &lt;&lt; 24);
          </block>

          <control if="tracePortWidth == 1">
            <block>
              gpioRoute |= 0x00003000;
            </block>
          </control>

          <control if="tracePortWidth == 2">
            <block>
              gpioRoute |= 0x00007000;
            </block>
          </control>

          <control if="tracePortWidth == 4">
            <block>
              gpioRoute |= 0x0001F000;
            </block>
          </control>

          <control if="PinLocationTPIU == 0">
            <block>
              Write32(0x40006070, ((Read32(0x40006070) &amp; ~0xF0000000) | 0x40000000)); // GPIO_PD_MODEL Pin 7 - PUSHPULL: TRACECLK
              Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x0F000000) | 0x04000000)); // GPIO_PD_MODEL Pin 6 - PUSHPULL: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x0000F000) | 0x00004000)); // GPIO_PD_MODEL Pin 3 - PUSHPULL: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x000F0000) | 0x00040000)); // GPIO_PD_MODEL Pin 4 - PUSHPULL: TRACEDATA2
                Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x00F00000) | 0x00400000)); // GPIO_PD_MODEL Pin 5 - PUSHPULL: TRACEDATA3
              </block>
            </control>
          </control>

          <control if="PinLocationTPIU == 1">
            <block>
              Write32(0x400060BC, ((Read32(0x400060BC) &amp; ~0x0000000F) | 0x00000004)); // GPIO_PF_MODEH Pin 0 - PUSHPULL: TRACECLK
              Write32(0x400060BC, ((Read32(0x400060BC) &amp; ~0x000000F0) | 0x00000040)); // GPIO_PF_MODEH Pin 1 - PUSHPULL: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006074, ((Read32(0x40006074) &amp; ~0x00F00000) | 0x00400000)); // GPIO_PD_MODEH Pin 5 - PUSHPULL: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x4000602C, ((Read32(0x4000602C) &amp; ~0xF0000000) | 0x40000000)); // GPIO_PB_MODEH Pin 7 - PUSHPULL: TRACEDATA2
                Write32(0x400060B8, ((Read32(0x400060B8) &amp; ~0x0000F000) | 0x00004000)); // GPIO_PF_MODEL Pin 3 - PUSHPULL: TRACEDATA3
              </block>
            </control>
          </control>

          <control if="PinLocationTPIU == 2">
            <block>
              Write32(0x4000604C, ((Read32(0x4000604C) &amp; ~0x0F000000) | 0x04000000)); // GPIO_PC_MODEL Pin 6 - PUSHPULL: TRACECLK
              Write32(0x4000604C, ((Read32(0x4000604C) &amp; ~0xF0000000) | 0x40000000)); // GPIO_PC_MODEL Pin 7 - PUSHPULL: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x0000F000) | 0x00004000)); // GPIO_PD_MODEL Pin 3 - PUSHPULL: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x000F0000) | 0x00040000)); // GPIO_PD_MODEL Pin 4 - PUSHPULL: TRACEDATA2
                Write32(0x40006070, ((Read32(0x40006070) &amp; ~0x00F00000) | 0x00400000)); // GPIO_PD_MODEL Pin 5 - PUSHPULL: TRACEDATA3
              </block>
            </control>
          </control>

          <control if="PinLocationTPIU == 3">
            <block>
              Write32(0x40006004, ((Read32(0x40006004) &amp; ~0x0F000000) | 0x04000000)); // GPIO_PA_MODEL Pin 6 - PUSHPULL: TRACECLK
              Write32(0x40006004, ((Read32(0x40006004) &amp; ~0x00000F00) | 0x00000400)); // GPIO_PA_MODEL Pin 2 - PUSHPULL: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006004, ((Read32(0x40006004) &amp; ~0x0000F000) | 0x00004000)); // GPIO_PA_MODEL Pin 3 - PUSHPULL: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x40006004, ((Read32(0x40006004) &amp; ~0x000F0000) | 0x00040000)); // GPIO_PA_MODEL Pin 4 - PUSHPULL: TRACEDATA2
                Write32(0x40006004, ((Read32(0x40006004) &amp; ~0x00F00000) | 0x00400000)); // GPIO_PA_MODEL Pin 5 - PUSHPULL: TRACEDATA3
              </block>
            </control>
          </control>

          <block>
            Write32(0x40006120, (Read32(0x40006120) &amp; ~gpioRouteMask) | gpioRoute); // GPIO_ROUTE
          </block>
        </sequence>
        <!-- End: EnableTraceTPIU Sequence -->


        <!-- Begin: DisableTraceSWO Sequence -->
        <sequence name="DisableTraceSWO">
          <block>
            // Disable GPIO_ROUTE.SWOPEN
            Write32(0x40006120, (Read32(0x40006120) &amp; ~(1 &lt;&lt; 2)));
          </block>

          <control if="PinLocationSWO == 0">
            <block>
              Write32(0x400060B8, (Read32(0x400060B8) &amp; ~0x00000F00)); // GPIO_PF_MODEL Pin 2 - DISABLED: SWO
            </block>
          </control>

          <control if="PinLocationSWO == 1">
            <block>
              Write32(0x40006050, (Read32(0x40006050) &amp; ~0xF0000000)); // GPIO_PC_MODEH Pin 7 - DISABLED: SWO
            </block>
          </control>

          <control if="PinLocationSWO == 2">
            <block>
              Write32(0x40006070, (Read32(0x40006070) &amp; ~0x0000000F)); // GPIO_PD_MODEL Pin 0 - DISABLED: SWO
            </block>
          </control>

