glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32GGxxx_DFP.pdsc
    <component Cclass="Device" Cgroup="emlib" Csub="TIMER"     Cversion="5.1.3" condition="emlib Framework">
      <description>Timer/Counter (TIMER) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_TIMER
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__TIMER.html"/>
        <file category="header"  name="emlib/inc/em_timer.h"/>
        <file category="source"  name="emlib/src/em_timer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="USART"     Cversion="5.1.3" condition="emlib CMU">
      <description>Universal Synchronous/Asynchronous Receiver/Transmitter (USART) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_USART
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__USART.html"/>
        <file category="header"  name="emlib/inc/em_usart.h"/>
        <file category="source"  name="emlib/src/em_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="VCMP"      Cversion="5.1.3" condition="emlib Framework">
      <description>Voltage Comparator (VCMP) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_VCMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__VCMP.html"/>
        <file category="header"  name="emlib/inc/em_vcmp.h"/>
        <file category="source"  name="emlib/src/em_vcmp.c"/>
      </files>
    </component>
    <!-- (not available) component Cclass="Device" Cgroup="emlib" Csub="VDAC"      Cversion="5.1.3" condition="emlib CMU">
      <description>Digital to Analog Voltage Converter (VDAC) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_VDAC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__VDAC.html"/>
        <file category="header"  name="emlib/inc/em_vdac.h"/>
        <file category="source"  name="emlib/src/em_vdac.c"/>
      </files>
    </component-->
    <component Cclass="Device" Cgroup="emlib" Csub="WDOG"      Cversion="5.1.3" condition="emlib Framework">
      <description>Watchdog (WDOG) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_WDOG
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__WDOG.html"/>
        <file category="header"  name="emlib/inc/em_wdog.h"/>
        <file category="source"  name="emlib/src/em_wdog.c"/>
      </files>
    </component>

    <!-- emdrv -->
    <component Cclass="Device" Cgroup="emdrv" Csub="DMADRV"    Cversion="5.1.3" condition="emdrv DMADRV">
      <description>DMADRV Direct Memory Access Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_DMADRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__DMADRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/dmadrv/inc/dmadrv.h"/>
        <file category="source"  name="emdrv/dmadrv/src/dmadrv.c"/>
        <file category="header"  name="emdrv/dmadrv/config/dmadrv_config.h" attr="config" version="5.1.3"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="GPIOINT"   Cversion="5.1.3" condition="emdrv GPIOINT">
      <description>General Purpose Input/Output Interrupt dispatcher</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_GPIOINT
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__GPIOINT.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/gpiointerrupt/inc/gpiointerrupt.h"/>
        <file category="source"  name="emdrv/gpiointerrupt/src/gpiointerrupt.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="NVM"       Cversion="5.1.3" condition="emdrv NVM">
      <description>Non-volatile Memory Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_NVM
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__NVM.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/nvm/config/nvm_config.h" attr="config" version="5.1.3"/>
        <file category="source"  name="emdrv/nvm/config/nvm_config.c"/>
        <file category="header"  name="emdrv/nvm/inc/nvm.h"/>
        <file category="source"  name="emdrv/nvm/src/nvm.c"/>
        <file category="source"  name="emdrv/nvm/src/nvm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="RTCDRV"    Cversion="5.1.3" condition="emdrv RTCDRV">
      <description>Real Time Clock Timer Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_RTCDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__RTCDRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/rtcdrv/config/rtcdrv_config.h" attr="config" version="5.1.3"/>
        <file category="header"  name="emdrv/rtcdrv/inc/rtcdriver.h"/>
        <file category="source"  name="emdrv/rtcdrv/src/rtcdriver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="SLEEP"     Cversion="5.1.3" condition="emdrv SLEEP">
      <description>Sleep Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_SLEEP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__SLEEP.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/sleep/inc/sleep.h"/>
        <file category="source"  name="emdrv/sleep/src/sleep.c"/>
      </files>
    </component>
