glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32GGxxx_DFP.pdsc
    <component Cclass="Device" Cgroup="emdrv" Csub="SPIDRV"    Cversion="5.1.3" condition="emdrv SPIDRV">
      <description>Serial Peripheral Interface Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_SPIDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__SPIDRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/spidrv/config/spidrv_config.h" attr="config" version="5.1.3"/>
        <file category="header"  name="emdrv/spidrv/inc/spidrv.h"/>
        <file category="source"  name="emdrv/spidrv/src/spidrv.c"/>
      </files>
    </component>
    <!-- (does not compile ) component Cclass="Device" Cgroup="emdrv" Csub="TEMPDRV"    Cversion="5.1.3" condition="emdrv TEMPDRV">
      <description>Temperature Sensor Interface Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_TEMPDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__TEMPDRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/tempdrv/config/tempdrv_config.h" attr="config" version="5.1.3"/>
        <file category="header"  name="emdrv/tempdrv/inc/tempdrv.h"/>
        <file category="source"  name="emdrv/tempdrv/src/tempdrv.c"/>
      </files>
    </component-->

    <component Cclass="CMSIS Driver" Cgroup="SPI"        Capiversion="2.1" Cversion="2.1" condition="EFM32GG CMSIS GPIO CMU DMA">
      <description>SPI (USART in SPI mode) Driver for EFM32GG Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source"  name="RTE_Driver/DMA_EFM32GGxxx.c"/>
        <file category="source"  name="RTE_Driver/SPI_EFM32GGxxx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1" Cversion="2.4" condition="EFM32GG CMSIS GPIO CMU">
      <description>USB Device Driver for EFM32GG Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source"  name="RTE_Driver/USB_EFM32GGxxx.c"/>
        <file category="source"  name="RTE_Driver/USBD_EFM32GGxxx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"   Capiversion="2.0" Cversion="2.6" condition="EFM32GG CMSIS GPIO CMU">
      <description>USB Host Driver for EFM32GG Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source"  name="RTE_Driver/USB_EFM32GGxxx.c"/>
        <file category="source"  name="RTE_Driver/USBH_EFM32GGxxx.c"/>
      </files>
    </component>

    <bundle Cbundle="EFM32GG DFP" Cclass="Graphics" Cversion="5.1.3">
      <description>Silicon Labs Graphics Library</description>
      <doc></doc>
      <component Cgroup="CORE" condition="glib CORE">
        <description>glib CORE</description>
        <RTE_Components_h>
          #define RTE_GLIB_CORE
        </RTE_Components_h>
        <files>
          <file category="include" name="glib/"/>
          <file category="header"  name="glib/glib/glib.h"/>
          <file category="source"  name="glib/glib/glib.c"/>
          <file category="source"  name="glib/glib/glib_bitmap.c"/>
          <file category="source"  name="glib/glib/glib_circle.c"/>
          <file category="source"  name="glib/glib/glib_line.c"/>
          <file category="source"  name="glib/glib/glib_polygon.c"/>
          <file category="source"  name="glib/glib/glib_rectangle.c"/>
          <file category="source"  name="glib/glib/glib_string.c"/>
          <file category="source"  name="glib/glib/glib_font_narrow_6x8.c"/>
          <file category="source"  name="glib/glib/glib_font_normal_8x8.c"/>
          <file category="source"  name="glib/glib/glib_font_number_16x20.c"/>
          <file category="source"  name="glib/glib/bmp.c"/>
        </files>
      </component>
      <component Cgroup="Display Driver" Cvariant="DISPLAY" condition="glib Driver DISPLAY">
        <description>glib Display Driver</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER
        </RTE_Components_h>
        <files>
          <file category="include" name="glib/"/>
          <file category="include" name="glib/dmd/"/>
          <file category="source"  name="glib/dmd/display/dmd_display.c"/>
        </files>
      </component>
      <component Cgroup="Display Driver" Cvariant="SSD2119 16-bit IF" condition="glib Driver SSD2119 16-bit">
        <description>glib Display Driver SSD2119 16-bit Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_16
        </RTE_Components_h>
        <files>
          <file category="include" name="glib/"/>
          <file category="source"  name="glib/dmd/ssd2119/dmd_ssd2119_16bit.c"/>
          <file category="source"  name="glib/dmd/ssd2119/dmdif_ssd2119_ebi16.c"/>
        </files>
      </component>
<!-- Not available on Giant Gecko DK and STK
      <component Cgroup="Display Driver" Cvariant="SSD2119 18-bit IF" condition="glib Driver SSD2119 18-bit">
        <description>glib Display Driver SSD2119 18-bit Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_18
        </RTE_Components_h>
        <files>
          <file category="include" name="glib/"/>
          <file category="source"  name="glib/dmd/ssd2119/dmd_ssd2119.c"/>
          <file category="source"  name="glib/dmd/ssd2119/dmdif_ssd2119_ebi.c"/>
        </files>
      </component>
