glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32GGxxx_DFP.pdsc
      <component Cgroup="Display Driver" Cvariant="SSD2119 SPI IF" condition="glib Driver SSD2119 SPI">
        <description>glib Display Driver SSD2119 SPI Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_SPI
        </RTE_Components_h>
        <files>
          <file category="include" name="glib/"/>
          <file category="source"  name="glib/dmd/ssd2119/dmd_ssd2119.c"/>
          <file category="source"  name="glib/dmd/ssd2119/dmdif_ssd2119_spi.c"/>
        </files>
      </component>
-->
      <component Cgroup="Display Driver" Cvariant="SSD2119 RGB IF" condition="glib Driver SSD2119 RGB">
        <description>glib Display Driver SSD2119 RGB Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_RGB
        </RTE_Components_h>
        <files>
          <file category="include" name="glib/"/>
          <file category="source"  name="glib/dmd/ssd2119/dmd_ssd2119_direct.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="EFM32GG-DK3750" Cclass="Board Support" Cversion="5.1.3">
      <description>Silicon Labs EFM32GG-DK3750 Development Kit</description>
      <doc>Boards/SiliconLabs/EFM32GG_DK3750/Documents/efm32gg-dk3750-ug.pdf</doc>

      <component Cgroup="CORE" condition="EFM32GG DK3750">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DK3750
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__kitdrv.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_dk_3201.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_dk_leds.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_dk_mcuboard.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp_trace.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_trace.c"/>
          <file category="include" name="Boards/SiliconLabs/EFM32GG_DK3750/config/"/>
        </files>
      </component>

<!-- Not available on Giant Gecko DK and STK
      <component Cgroup="Drivers" Csub="CapSense" Cvariant="Standard" condition="BSP Driver CapSense">
        <description>CapSense Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__CapSense.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/capsense.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/capsense.c"/>
        </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="DmaCtrl"                          condition="BSP Driver DmaCtrl">
        <description>DmaCtrl Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_DMACTRL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__DmaCtrl.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/dmactrl.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/dmactrl.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Eeprom"                           condition="BSP Driver Eeprom">
        <description>Eeprom Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_EEPROM
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Eeprom.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/eeprom.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I2cSpm"                           condition="BSP Driver I2cSpm">
        <description>I2cSpm Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_I2C
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__I2CSPM.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/i2cspm.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/i2cspm.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Ksz8851snl SPI"                   condition="BSP Driver Ksz8851snl SPI">
        <description>Ksz8851snl SPI Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_KSZ8851SNL_SPI
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__ksz8851snl.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/ksz8851snl_spi.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/ksz8851snl_spi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Ksz8851snl"                       condition="BSP Driver Ksz8851snl">
        <description>Ksz8851snl Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_KSZ8851SNL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__ksz8851snl.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/ksz8851snl.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/ksz8851snl.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NorFlash"                         condition="BSP Driver NorFlash">
        <description>NorFlash Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_NORFLASH
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__NorFlash.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/norflash.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/norflash.c"/>
        </files>
      </component>
