glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32GGxxx_DFP.pdsc
      <component Cgroup="LED"           Capiversion="1.0.0"                      condition="EFM32GG BSP">
        <description>LED interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/LED_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0"                      condition="EFM32GG BSP">
        <description>Buttons interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/Buttons_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0"                      condition="EFM32GG BSP">
        <description>Joystick interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/Joystick_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD"   Capiversion="1.0.0"                      condition="EFM32GG BSP GLIB TFT">
        <description>Graphic LCD interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="header"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/GLCD_Config.h"/>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/GLCD_Fonts.c"/>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/GLCD_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD"     Capiversion="1.0.0" Cvariant="16-bit IF" condition="EFM32GG BSP">
        <description>emWin LCD 16-bit Interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="include" name="glib/dmd/ssd2119/"/>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/LCDConf_16.c" attr="config" version="5.00"/>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/LCD_X_16.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD"     Capiversion="1.0.0" Cvariant="RGB IF"    condition="EFM32GG BSP">
        <description>emWin LCD RGB Interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="include" name="glib/dmd/ssd2119/"/>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/LCDConf_RGB.c" attr="config" version="5.00"/>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/LCD_X_RGB.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen"   Capiversion="1.0.0"                      condition="EFM32GG BSP Touch">
        <description>Touchscreen interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/Touch_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer"   Capiversion="1.0.0" Csub="DS75"          condition="EFM32GG BSP TempSensor">
        <description>Thermometer interface for DS75</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/Thermometer_DS75.c"/>
        </files>
      </component>
      <component Cgroup="EEPROM"        Capiversion="1.0.0" Csub="24AA024"       condition="EFM32GG BSP EEPROM">
        <description>EEPROM interface for 24AA024</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/EEPROM_24AA024.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="EFM32GG-STK3700" Cclass="Board Support" Cversion="5.1.3">
      <description>Silicon Labs EFM32GG-STK3700 Development Kit</description>
      <doc>Boards/SiliconLabs/EFM32GG_STK3700/Documents/efm32gg-stk3700-ug.pdf</doc>

      <component Cgroup="CORE" condition="EFM32GG STK3700">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_STK3700
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__BSP.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_bcc.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk_leds.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp_trace.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_trace.c"/>
          <file category="include" name="Boards/SiliconLabs/EFM32GG_STK3700/config/"/>
        </files>
      </component>

<!-- Not available on Giant Gecko DK and STK
      <component Cgroup="Drivers" Csub="CapSense" Cvariant="Standard" condition="BSP Driver CapSense">
        <description>CapSense Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__CapSense.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/capsense.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/capsense.c"/>
        </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="CapSense"   Cvariant="Low Energy"  condition="BSP Driver CapSense LE">
        <description>CapSense Driver (Low Energy)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE_LE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__CapSense.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/caplesense.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/caplesense.c"/>
        </files>
      </component>
